KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/Gen/src/Adc_PBcfg.c
/* Check if source file and Adc_Reg_eSys_Eqadc header file are of the same Software version */
#if ((ADC_SW_MAJOR_VERSION_PBCFG_C != ADC_SW_MAJOR_VERSION_REG) || \
     (ADC_SW_MINOR_VERSION_PBCFG_C != ADC_SW_MINOR_VERSION_REG) || \
     (ADC_SW_PATCH_VERSION_PBCFG_C != ADC_SW_PATCH_VERSION_REG) \
    )
    #error "Software Version Numbers of Adc_PBcfg.c and Adc_Reg_eSys_Eqadc.h are different"
#endif

/*==================================================================================================
*                          LOCAL TYPEDEFS (STRUCTURES, UNIONS, ENUMS)
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL MACROS
==================================================================================================*/
/**
* @brief          Total number of groups in Config.
*
*/

#define ADC_GROUPS_1           33


/*==================================================================================================
*                                       GLOBAL FUNCTIONS
==================================================================================================*/
#define ADC_START_SEC_CODE
/**
 * @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include"
 * @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h
 */
#include "MemMap.h"

/**
* @brief         ADC Notification functions.
* @details       ADC Nofification functions defined inside the Plugin.
*
*/


#define ADC_STOP_SEC_CODE
/**
 * @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include"
 * @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h
 */
#include "MemMap.h"

/*==================================================================================================
*                                      LOCAL CONSTANTS
==================================================================================================*/
#define ADC_START_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/**
* @brief          Group Assignments on ADC Hardware unit 0 Configuration 1.
*
*/
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group0_AssignmentPB_0_1[ADC_CFGSET1_GROUP_0_CHANNELS] =
{
    0U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group1_AssignmentPB_0_1[ADC_CFGSET1_GROUP_1_CHANNELS] =
{
    1U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group2_AssignmentPB_0_1[ADC_CFGSET1_GROUP_2_CHANNELS] =
{
    2U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group3_AssignmentPB_0_1[ADC_CFGSET1_GROUP_3_CHANNELS] =
{
    3U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group4_AssignmentPB_0_1[ADC_CFGSET1_GROUP_4_CHANNELS] =
{
    4U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group5_AssignmentPB_0_1[ADC_CFGSET1_GROUP_5_CHANNELS] =
{
    5U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group6_AssignmentPB_0_1[ADC_CFGSET1_GROUP_6_CHANNELS] =
{
    6U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group7_AssignmentPB_0_1[ADC_CFGSET1_GROUP_7_CHANNELS] =
{
    7U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group8_AssignmentPB_0_1[ADC_CFGSET1_GROUP_8_CHANNELS] =
{
    8U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group9_AssignmentPB_0_1[ADC_CFGSET1_GROUP_9_CHANNELS] =
{
    9U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group10_AssignmentPB_0_1[ADC_CFGSET1_GROUP_10_CHANNELS] =
{
    10U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group11_AssignmentPB_0_1[ADC_CFGSET1_GROUP_11_CHANNELS] =
{
    11U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group12_AssignmentPB_0_1[ADC_CFGSET1_GROUP_12_CHANNELS] =
{
    12U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group13_AssignmentPB_0_1[ADC_CFGSET1_GROUP_13_CHANNELS] =
{
    13U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group14_AssignmentPB_0_1[ADC_CFGSET1_GROUP_14_CHANNELS] =
{
    14U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group15_AssignmentPB_0_1[ADC_CFGSET1_GROUP_15_CHANNELS] =
{
    15U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group16_AssignmentPB_0_1[ADC_CFGSET1_GROUP_16_CHANNELS] =
{
    16U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group17_AssignmentPB_0_1[ADC_CFGSET1_GROUP_17_CHANNELS] =
{
    17U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group18_AssignmentPB_0_1[ADC_CFGSET1_GROUP_18_CHANNELS] =
{
    18U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group19_AssignmentPB_0_1[ADC_CFGSET1_GROUP_19_CHANNELS] =
{
    19U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group20_AssignmentPB_0_1[ADC_CFGSET1_GROUP_20_CHANNELS] =
{
    20U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group21_AssignmentPB_0_1[ADC_CFGSET1_GROUP_21_CHANNELS] =
{
    21U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group22_AssignmentPB_0_1[ADC_CFGSET1_GROUP_22_CHANNELS] =
{
    22U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group23_AssignmentPB_0_1[ADC_CFGSET1_GROUP_23_CHANNELS] =
{
    23U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group30_AssignmentPB_0_1[ADC_CFGSET1_GROUP_30_CHANNELS] =
{
    24U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group31_AssignmentPB_0_1[ADC_CFGSET1_GROUP_31_CHANNELS] =
{
    25U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group32_AssignmentPB_0_1[ADC_CFGSET1_GROUP_32_CHANNELS] =
{
    26U
};
/**
* @brief          Group Assignments on ADC Hardware unit 1 Configuration 1.
*
*/
/**
* @brief          Group Assignments on ADC Hardware unit 2 Configuration 1.
*
*/
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group24_AssignmentPB_2_1[ADC_CFGSET1_GROUP_24_CHANNELS] =
{
    4U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group25_AssignmentPB_2_1[ADC_CFGSET1_GROUP_25_CHANNELS] =
{
    1U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group26_AssignmentPB_2_1[ADC_CFGSET1_GROUP_26_CHANNELS] =
{
    2U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group27_AssignmentPB_2_1[ADC_CFGSET1_GROUP_27_CHANNELS] =
{
    3U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group28_AssignmentPB_2_1[ADC_CFGSET1_GROUP_28_CHANNELS] =
{
    4U
};
static CONST(Adc_ChannelType, ADC_CONST) Adc_Group29_AssignmentPB_2_1[ADC_CFGSET1_GROUP_29_CHANNELS] =
{
    5U
};
/**
* @brief          Group Assignments on ADC Hardware unit 3 Configuration 1.
*
*/


/**
* @brief          Definition of ADC hardware units Configuration 1.
*/
static CONST(Adc_Eqadc_HwUnitConfigurationType, ADC_CONST) Adc_HwUnitCfgPB_1[] =
{
    /**< @brief Hardware Unit ADC0 */
    {
        /**< @brief Hardware unit id */
        (Adc_HwUnitType)0,
        (EQADC_ADC_EN_U16| EQADC_ADC_CLK_PS_2_U8)
#if (ADC_CALIBRATION == STD_ON)
        ,
        (boolean)FALSE /**< @brief calibration is/isn't performed  */
#endif /* (ADC_CALIBRATION == STD_ON) */
#if (ADC_DUAL_CLOCK_MODE == STD_ON)
        ,
        (EQADC_ADC_EN_U16| EQADC_ADC_CLK_PS_31_U8)
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

    },
    /**< @brief Hardware Unit ADC2 */
    {
        /**< @brief Hardware unit id */
        (Adc_HwUnitType)2,
        (EQADC_ADC_EN_U16 | EQADC_ADC_CLK_SEL_U8)
#if (ADC_CALIBRATION == STD_ON)
        ,
        (boolean)FALSE /**< @brief calibration is/isn't performed  */
#endif /* (ADC_CALIBRATION == STD_ON) */
#if (ADC_DUAL_CLOCK_MODE == STD_ON)
        ,
        (EQADC_ADC_EN_U16 | EQADC_ADC_CLK_SEL_U8)
#endif /* (ADC_DUAL_CLOCK_MODE == STD_ON) */

