KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/Gen/src/Adc_PBcfg.c
    }
};


/**
* @brief          Definition of channels on ADC Hardware unit 0 - Configuration 1.
* @details        Array of conversion command messages
*/
static CONST(Adc_Eqadc_ChannelConfigurationType, ADC_CONST) Adc_ChannelsCfgPB_0_1[] =
{

    /**< @brief Hardware Unit ADC0  --  AN_0 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(0)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_2 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(2)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_3 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(3)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_5 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(5)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_6 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(6)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_8 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(8)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_9 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(9)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_10 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(10)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_11 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(11)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_12 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(12)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_13 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(13)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_14 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(14)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_15 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(15)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_16 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(16)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_17 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(17)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_22 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(22)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_23 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(23)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_24 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(24)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_26 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(26)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_27 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(27)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_28 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(28)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_37 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(37)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_38 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(38)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_39 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(39)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_1 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(1)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_7 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(7)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC0  --  AN_4 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(4)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    }
};
/**
* @brief          Definition of channels on ADC Hardware unit 2 - Configuration 1.
* @details        Array of conversion command messages
*/
static CONST(Adc_Eqadc_ChannelConfigurationType, ADC_CONST) Adc_ChannelsCfgPB_2_1[] =
{

    /**< @brief Hardware Unit ADC2  --  AN_17 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(17)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC2  --  AN_18 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(18)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC2  --  AN_19 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(19)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC2  --  AN_21 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(21)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC2  --  AN_22 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(22)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    },
    /**< @brief Hardware Unit ADC2  --  AN_23 */
    {
        /**< @brief Adc channel's command */
        (uint32)(EQADC_ADC_CONV_COM_BN0_U32  | EQADC_ADC_128_CLOCK_CYCLES_U32| EQADC_ADC_CONV_COM_FMT_RJU_U32 | ((uint32)ADC_ID_CHANNEL_U8(23)<<8U) | (uint32)EQADC_12BIT_RES_CONFIG_SEL_U16),
        /**< @brief Adc resolution */
        (Adc_ResolutionType)ADC_BITS_RESOLUTION_12_U8
    }
};


#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/*==================================================================================================
*                                      LOCAL VARIABLES
==================================================================================================*/
#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"
/**
* @brief          Adc Result Buffer RAM initializations.
* @details        Array for all ADC group result ram buffers.
*/
static P2VAR(Adc_ValueGroupType, ADC_VAR, ADC_APPL_DATA) Adc_ResultsBufferPtr[] =
{
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR,
    NULL_PTR
};


/**
* @brief          Definition of channels's pointer structure Configuration 1.
*
*/
static P2CONST(Adc_Eqadc_ChannelConfigurationType, ADC_VAR, ADC_APPL_CONST) Adc_ChannelsCfgPB_1[] =
{
    Adc_ChannelsCfgPB_0_1,
    NULL_PTR,
    Adc_ChannelsCfgPB_2_1,
    NULL_PTR
};


