KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/Gen/src/Adc_PBcfg.c
        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
        /**< @brief CFIFO used for group */
        0U,
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
        /**< @brief Number of streaming samples */
        ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group */
        Adc_Group27_AssignmentPB_2_1,
        /**< @brief Number of channels in the group */
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_27_CHANNELS,
        (uint8)STD_ON
    },
    /**< @brief Group28 -- Hardware Unit ADC2 */
    {
        /**< @brief Hardware unit configured */
        (Adc_HwUnitType)2,
        /**< @brief Access mode */
        ADC_ACCESS_MODE_SINGLE,
        /**< @brief Conversion mode */
        ADC_CONV_MODE_ONESHOT,
        /**< @brief Conversion type */
        ADC_CONV_TYPE_NORMAL,
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
        /**< @brief  Priority configured */
        ADC_GROUP_PRIORITY(0U),
#endif /* (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) */
        /**< @brief Replacement mode */
        ADC_GROUP_REPL_ABORT_RESTART,
        /**< @brief Trigger source configured */
        ADC_TRIGG_SRC_SW,
#if (STD_ON==ADC_HW_TRIGGER_API)
        /**< @brief Hardware trigger signal */
        ADC_HW_TRIG_RISING_EDGE,
        /**< @brief Hardware resource for the group */
        0U,
#endif /* (STD_ON==ADC_HW_TRIGGER_API) */
#if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
        /**< @brief Notification function */

        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
        /**< @brief CFIFO used for group */
        0U,
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
        /**< @brief Number of streaming samples */
        ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group */
        Adc_Group28_AssignmentPB_2_1,
        /**< @brief Number of channels in the group */
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_28_CHANNELS,
        (uint8)STD_ON
    },
    /**< @brief Group29 -- Hardware Unit ADC2 */
    {
        /**< @brief Hardware unit configured */
        (Adc_HwUnitType)2,
        /**< @brief Access mode */
        ADC_ACCESS_MODE_SINGLE,
        /**< @brief Conversion mode */
        ADC_CONV_MODE_ONESHOT,
        /**< @brief Conversion type */
        ADC_CONV_TYPE_NORMAL,
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
        /**< @brief  Priority configured */
        ADC_GROUP_PRIORITY(0U),
#endif /* (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) */
        /**< @brief Replacement mode */
        ADC_GROUP_REPL_ABORT_RESTART,
        /**< @brief Trigger source configured */
        ADC_TRIGG_SRC_SW,
#if (STD_ON==ADC_HW_TRIGGER_API)
        /**< @brief Hardware trigger signal */
        ADC_HW_TRIG_RISING_EDGE,
        /**< @brief Hardware resource for the group */
        0U,
#endif /* (STD_ON==ADC_HW_TRIGGER_API) */
#if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
        /**< @brief Notification function */

        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
        /**< @brief CFIFO used for group */
        0U,
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
        /**< @brief Number of streaming samples */
        ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group */
        Adc_Group29_AssignmentPB_2_1,
        /**< @brief Number of channels in the group */
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_29_CHANNELS,
        (uint8)STD_ON
    },
    /**< @brief Group30 -- Hardware Unit ADC0 */
    {
        /**< @brief Hardware unit configured */
        (Adc_HwUnitType)0,
        /**< @brief Access mode */
        ADC_ACCESS_MODE_SINGLE,
        /**< @brief Conversion mode */
        ADC_CONV_MODE_ONESHOT,
        /**< @brief Conversion type */
        ADC_CONV_TYPE_NORMAL,
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
        /**< @brief  Priority configured */
        ADC_GROUP_PRIORITY(0U),
#endif /* (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) */
        /**< @brief Replacement mode */
        ADC_GROUP_REPL_ABORT_RESTART,
        /**< @brief Trigger source configured */
        ADC_TRIGG_SRC_SW,
#if (STD_ON==ADC_HW_TRIGGER_API)
        /**< @brief Hardware trigger signal */
        ADC_HW_TRIG_RISING_EDGE,
        /**< @brief Hardware resource for the group */
        0U,
#endif /* (STD_ON==ADC_HW_TRIGGER_API) */
#if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
        /**< @brief Notification function */

        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
        /**< @brief CFIFO used for group */
        0U,
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
        /**< @brief Number of streaming samples */
        ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group */
        Adc_Group30_AssignmentPB_0_1,
        /**< @brief Number of channels in the group */
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_30_CHANNELS,
        (uint8)STD_ON
    },
    /**< @brief Group31 -- Hardware Unit ADC0 */
    {
        /**< @brief Hardware unit configured */
        (Adc_HwUnitType)0,
        /**< @brief Access mode */
        ADC_ACCESS_MODE_SINGLE,
        /**< @brief Conversion mode */
        ADC_CONV_MODE_ONESHOT,
        /**< @brief Conversion type */
        ADC_CONV_TYPE_NORMAL,
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
        /**< @brief  Priority configured */
        ADC_GROUP_PRIORITY(0U),
#endif /* (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) */
        /**< @brief Replacement mode */
        ADC_GROUP_REPL_ABORT_RESTART,
        /**< @brief Trigger source configured */
        ADC_TRIGG_SRC_SW,
#if (STD_ON==ADC_HW_TRIGGER_API)
        /**< @brief Hardware trigger signal */
        ADC_HW_TRIG_RISING_EDGE,
        /**< @brief Hardware resource for the group */
        0U,
#endif /* (STD_ON==ADC_HW_TRIGGER_API) */
#if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
        /**< @brief Notification function */

        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
        /**< @brief CFIFO used for group */
        0U,
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
        /**< @brief Number of streaming samples */
        ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group */
        Adc_Group31_AssignmentPB_0_1,
        /**< @brief Number of channels in the group */
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_31_CHANNELS,
        (uint8)STD_ON
    },
    /**< @brief Group32 -- Hardware Unit ADC0 */
    {
        /**< @brief Hardware unit configured */
        (Adc_HwUnitType)0,
        /**< @brief Access mode */
        ADC_ACCESS_MODE_SINGLE,
        /**< @brief Conversion mode */
        ADC_CONV_MODE_ONESHOT,
        /**< @brief Conversion type */
        ADC_CONV_TYPE_NORMAL,
#if (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE)
        /**< @brief  Priority configured */
        ADC_GROUP_PRIORITY(0U),
#endif /* (ADC_PRIORITY_IMPLEMENTATION != ADC_PRIORITY_NONE) */
        /**< @brief Replacement mode */
        ADC_GROUP_REPL_ABORT_RESTART,
        /**< @brief Trigger source configured */
        ADC_TRIGG_SRC_SW,
#if (STD_ON==ADC_HW_TRIGGER_API)
        /**< @brief Hardware trigger signal */
        ADC_HW_TRIG_RISING_EDGE,
        /**< @brief Hardware resource for the group */
        0U,
#endif /* (STD_ON==ADC_HW_TRIGGER_API) */
#if (STD_ON==ADC_GRP_NOTIF_CAPABILITY)
        /**< @brief Notification function */

        NULL_PTR,
#endif /* (STD_ON==ADC_GRP_NOTIF_CAPABILITY) */
        /**< @brief CFIFO used for group */
        0U,
        /**< @brief ADC Group Result Buffers RAM array */
        Adc_ResultsBufferPtr,
        /**< @brief Group Streaming Buffer Mode */
        ADC_STREAM_BUFFER_LINEAR,
        /**< @brief Number of streaming samples */
        ADC_STREAMING_NUM_SAMPLES(1),
        /**< @brief Channels assigned to the group */
        Adc_Group32_AssignmentPB_0_1,
        /**< @brief Number of channels in the group */
        (Adc_ChannelIndexType)ADC_CFGSET1_GROUP_32_CHANNELS,
        (uint8)STD_ON
    }
};


/**
* @brief          ADC driver Configuration structure 1.
*/
/** @violates @ref Adc_PBcfg_c_REF_4 MISRA-C:2004 Rule 8.10: External linkage.*/
CONST(Adc_ConfigType, ADC_CONST) AdcConfigSet_0 =
{
    /**< @brief pointer to Hw unit configurations */
    Adc_HwUnitCfgPB_1,
    /**< @brief pointer to group configurations */
    Adc_GroupsCfgPB_1,
    /**< @brief pointer to channel configurations */
    Adc_ChannelsCfgPB_1,
    /**< @brief total number of groups */
    (Adc_GroupType)ADC_GROUPS_1,
    /**< @brief Miscellaneous configuration parameters. - Adc_Eqadc_MultiConfigType */
    {
        {
            ADC_INTERRUPT,
            ADC_INTERRUPT,
            ADC_INTERRUPT,
            ADC_INTERRUPT

        },
        /**< @brief number of the maximum groups in the current configuration */
        33U,
        /**< @brief number of the maximum hardware units in the current configuration */
        2U,
#if(ADC_HW_TRIGGER_API == STD_ON)
        {
            /**< @brief low 8 bits of EQADC_ETDFR for EQADCA */
            0x5U,
            /**< @brief low 8 bits of EQADC_ETDFR for EQADCB */
            0x5U
        },
#endif
        {
            /**< @brief number of channels of the ADC Hardware unit 0 */
            27U,
            /**< @brief number of channels of the ADC Hardware unit 1 */
            0U,
            /**< @brief number of channels of the ADC Hardware unit 2 */
            6U,
            /**< @brief number of channels of the ADC Hardware unit 3 */
            0U
        },
        {
            /**< @brief ADC0 - ON/OFF */
            (uint8)STD_ON,
            /**< @brief ADC1 - ON/OFF */
            (uint8)STD_OFF,
            /**< @brief ADC2 - ON/OFF */
            (uint8)STD_ON,
            /**< @brief ADC3 - ON/OFF */
            (uint8)STD_OFF
        },
        {
            /**< @brief First fifo of ADC0 */
            (uint8)0U,
            /**< @brief First fifo of ADC1 */
            (uint8)0U,
            /**< @brief First fifo of ADC2 */
            (uint8)0U,
            /**< @brief First fifo of ADC3 */
            (uint8)0U
        },
        {
            0U,
            255U,
            1U,
            255U
        }
    }
};


#define ADC_STOP_SEC_CONFIG_DATA_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

#define ADC_START_SEC_CONST_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/

#include "MemMap.h"

