KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/Gen/src/Adc_PBcfg.c
    }
};
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */
#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          Definition of channels limit checking on ADC Hardware unit 2.
*/
static CONST(Adc_Eqadc_ChannelLimitCheckingType, ADC_CONST) Adc_ChannelsLimitCheckingCfg_2[] =
{
    /**< @brief Hardware Unit ADC2  --  AN_17 */
    {
        /**< @brief limit check disabled */
        (boolean)FALSE,
        /**< @brief range for limit check */
        (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
        /**< @brief high limit value */
        (Adc_ValueGroupType)0,
        /**< @brief low limit value */
        (Adc_ValueGroupType)0

    },
    /**< @brief Hardware Unit ADC2  --  AN_18 */
    {
        /**< @brief limit check disabled */
        (boolean)FALSE,
        /**< @brief range for limit check */
        (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
        /**< @brief high limit value */
        (Adc_ValueGroupType)0,
        /**< @brief low limit value */
        (Adc_ValueGroupType)0

    },
    /**< @brief Hardware Unit ADC2  --  AN_19 */
    {
        /**< @brief limit check disabled */
        (boolean)FALSE,
        /**< @brief range for limit check */
        (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
        /**< @brief high limit value */
        (Adc_ValueGroupType)0,
        /**< @brief low limit value */
        (Adc_ValueGroupType)0

    },
    /**< @brief Hardware Unit ADC2  --  AN_21 */
    {
        /**< @brief limit check disabled */
        (boolean)FALSE,
        /**< @brief range for limit check */
        (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
        /**< @brief high limit value */
        (Adc_ValueGroupType)0,
        /**< @brief low limit value */
        (Adc_ValueGroupType)0

    },
    /**< @brief Hardware Unit ADC2  --  AN_22 */
    {
        /**< @brief limit check disabled */
        (boolean)FALSE,
        /**< @brief range for limit check */
        (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
        /**< @brief high limit value */
        (Adc_ValueGroupType)0,
        /**< @brief low limit value */
        (Adc_ValueGroupType)0

    },
    /**< @brief Hardware Unit ADC2  --  AN_23 */
    {
        /**< @brief limit check disabled */
        (boolean)FALSE,
        /**< @brief range for limit check */
        (Adc_ChannelRangeSelectType)ADC_RANGE_ALWAYS,
        /**< @brief high limit value */
        (Adc_ValueGroupType)0,
        /**< @brief low limit value */
        (Adc_ValueGroupType)0

    }
};
#endif /* (ADC_ENABLE_LIMIT_CHECK == STD_ON) */



#define ADC_STOP_SEC_CONST_UNSPECIFIED
/** @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include" */
/** @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h*/
#include "MemMap.h"

/*==================================================================================================
*                                      GLOBAL VARIABLES
==================================================================================================*/

#define ADC_START_SEC_VAR_INIT_UNSPECIFIED
/**
 * @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include"
 *  @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h
 */
#include "MemMap.h"

#if (ADC_ENABLE_LIMIT_CHECK == STD_ON)
/**
* @brief          Definition of channels' limit checking pointer structure.
*
*/
P2CONST(Adc_Eqadc_ChannelLimitCheckingType, ADC_VAR, ADC_APPL_CONST) Adc_ChannelsLimitCheckingCfg[]=
{
    Adc_ChannelsLimitCheckingCfg_0,
    NULL_PTR,
    Adc_ChannelsLimitCheckingCfg_2,
    NULL_PTR
};
#endif


#define ADC_STOP_SEC_VAR_INIT_UNSPECIFIED
/**
 * @violates @ref Adc_PBcfg_c_REF_1 only preprocessor statements and comments before "#include"
 * @violates @ref Adc_PBcfg_c_REF_2 Repeated include file Memmap.h
 */
#include "MemMap.h"

/*==================================================================================================
*                                   LOCAL FUNCTION PROTOTYPES
==================================================================================================*/

/*==================================================================================================
*                                       LOCAL FUNCTIONS
==================================================================================================*/

#endif /* ADC_PRECOMPILE_SUPPORT */

#ifdef __cplusplus
}
#endif

/** @} */

